gin66/ESP32_projects/01_qrcode/src/identify.c
/* quirc - QR-code recognition library
 * Copyright (C) 2010-2012 Daniel Beer <dlbeer@gmail.com>
 *
 * Permission to use, copy, modify, and/or distribute this software for any
 * purpose with or without fee is hereby granted, provided that the above
 * copyright notice and this permission notice appear in all copies.
 *
 * THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
 * WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
 * ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
 * WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
 * ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
 * OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
 */

#include <limits.h>
#include <math.h>
#include <stdlib.h>
#include <string.h>

#define bool char
#include "esp32-hal-psram.h"
#include "quirc_internal.h"

/************************************************************************
 * Linear algebra routines
 */

static int line_intersect(const struct quirc_point *p0,
                          const struct quirc_point *p1,
                          const struct quirc_point *q0,
                          const struct quirc_point *q1, struct quirc_point *r) {
  /* (a, b) is perpendicular to line p */
  int a = -(p1->y - p0->y);
  int b = p1->x - p0->x;

  /* (c, d) is perpendicular to line q */
  int c = -(q1->y - q0->y);
  int d = q1->x - q0->x;

  /* e and f are dot products of the respective vectors with p and q */
  int e = a * p1->x + b * p1->y;
  int f = c * q1->x + d * q1->y;

  /* Now we need to solve:
   *     [a b] [rx]   [e]
   *     [c d] [ry] = [f]
   *
   * We do this by inverting the matrix and applying it to (e, f):
   *       [ d -b] [e]   [rx]
   * 1/det [-c  a] [f] = [ry]
   */
  int det = (a * d) - (b * c);

  if (!det) return 0;

  r->x = (d * e - b * f) / det;
  r->y = (-c * e + a * f) / det;

  return 1;
}

static void perspective_setup(float *c, const struct quirc_point *rect,
                              float w, float h) {
  float x0 = rect[0].x;
  float y0 = rect[0].y;
  float x1 = rect[1].x;
  float y1 = rect[1].y;
  float x2 = rect[2].x;
  float y2 = rect[2].y;
  float x3 = rect[3].x;
  float y3 = rect[3].y;

  float wden = w * (x2 * y3 - x3 * y2 + (x3 - x2) * y1 + x1 * (y2 - y3));
  float hden = h * (x2 * y3 + x1 * (y2 - y3) - x3 * y2 + (x3 - x2) * y1);

  c[0] = (x1 * (x2 * y3 - x3 * y2) +
          x0 * (-x2 * y3 + x3 * y2 + (x2 - x3) * y1) + x1 * (x3 - x2) * y0) /
         wden;
  c[1] = -(x0 * (x2 * y3 + x1 * (y2 - y3) - x2 * y1) - x1 * x3 * y2 +
           x2 * x3 * y1 + (x1 * x3 - x2 * x3) * y0) /
         hden;
  c[2] = x0;
  c[3] = (y0 * (x1 * (y3 - y2) - x2 * y3 + x3 * y2) + y1 * (x2 * y3 - x3 * y2) +
          x0 * y1 * (y2 - y3)) /
         wden;
  c[4] = (x0 * (y1 * y3 - y2 * y3) + x1 * y2 * y3 - x2 * y1 * y3 +
          y0 * (x3 * y2 - x1 * y2 + (x2 - x3) * y1)) /
         hden;
  c[5] = y0;
  c[6] = (x1 * (y3 - y2) + x0 * (y2 - y3) + (x2 - x3) * y1 + (x3 - x2) * y0) /
         wden;
  c[7] = (-x2 * y3 + x1 * y3 + x3 * y2 + x0 * (y1 - y2) - x3 * y1 +
          (x2 - x1) * y0) /
         hden;
}

static void perspective_map(const float *c, float u, float v,
                            struct quirc_point *ret) {
  float den = c[6] * u + c[7] * v + 1.0;
  float x = (c[0] * u + c[1] * v + c[2]) / den;
  float y = (c[3] * u + c[4] * v + c[5]) / den;

  ret->x = (int)rint(x);
  ret->y = (int)rint(y);
}

static void perspective_unmap(const float *c, const struct quirc_point *in,
                              float *u, float *v) {
  float x = in->x;
  float y = in->y;
  float den = -c[0] * c[7] * y + c[1] * c[6] * y +
               (c[3] * c[7] - c[4] * c[6]) * x + c[0] * c[4] - c[1] * c[3];

  *u = -(c[1] * (y - c[5]) - c[2] * c[7] * y + (c[5] * c[7] - c[4]) * x +
         c[2] * c[4]) /
       den;
  *v = (c[0] * (y - c[5]) - c[2] * c[6] * y + (c[5] * c[6] - c[3]) * x +
        c[2] * c[3]) /
       den;
}

/************************************************************************
 * Span-based floodfill routine
 */

#define FLOOD_FILL_MAX_DEPTH 4096

typedef void (*span_func_t)(void *user_data, int y, int left, int right);

struct flood_fill_task_s {
  int16_t left;
  int16_t right;
  int16_t y;
  int16_t i;
  int16_t direction;  // +1/-1/0
  quirc_pixel_t *row;
} *fft_depth = NULL;

static void flood_fill_seed(struct quirc *q, int _x, int _y, int from, int to,
                            span_func_t func, void *user_data, int depth) {
  if (fft_depth == NULL) {
    fft_depth = (struct flood_fill_task_s *)calloc(
        sizeof(struct flood_fill_task_s), FLOOD_FILL_MAX_DEPTH);
  }

  uint16_t task = 1;
  struct flood_fill_task_s *f = fft_depth;

  f->left = _x;
  f->right = _x;
  f->y = _y;
  f->direction = 0;

  while (task > 0) {
    if (f->direction == 0) {
      // This task is new, so do calculation as below
      f->row = q->pixels + f->y * q->w;

      while (f->left > 0 && f->row[f->left - 1] == from) f->left--;

      while (f->right < q->w - 1 && f->row[f->right + 1] == from) f->right++;

      /* Fill the extent */
      for (int16_t i = f->left; i <= f->right; i++) f->row[i] = to;

      if (func) func(user_data, f->y, f->left, f->right);

      if (f->y > 0) {
        f->direction = -1;
      } else if (f->y < q->h - 1) {
        f->direction = 1;
      }
      /* Seed new flood-fills */
      if ((f->direction != 0) && (task < FLOOD_FILL_MAX_DEPTH)) {
        f->row = q->pixels + (f->y + f->direction) * q->w;
        f->i = f->left;
      } else {
        // No sub tasks to generate
        task--;
        f--;
        continue;
      }
    }
    // calculation is done, then perform the loop for task generation
    if (f->i > f->right) {
      // current direction finished, check for other direction
      if ((f->direction == -1) && (f->y < q->h - 1)) {
        f->direction = 1;
        f->row = q->pixels + (f->y + f->direction) * q->w;
        f->i = f->left;
      }
    }
    if (f->i <= f->right) {
      // generate the next sub task
      if (f->row[f->i] == from) {
        f[1].y = f->y + f->direction;
        f[1].left = f->i;
        f[1].right = f->i;
        f[1].direction = 0;
        f->i++;
        task++;
        f++;
      } else {
        f->i++;
      }
    } else {
      task--;
      f--;
    }
  }
}

/************************************************************************
 * Adaptive thresholding
 */

static uint8_t otsu(const struct quirc *q) {
  int numPixels = q->w * q->h;

  // Calculate histogram
  unsigned int histogram[UINT8_MAX + 1];
  (void)memset(histogram, 0, sizeof(histogram));
  uint8_t *ptr = q->image;
  int length = numPixels;
  while (length--) {
    uint8_t value = *ptr++;
    histogram[value]++;
  }

  // Calculate weighted sum of histogram values
  unsigned int sum = 0;
  unsigned int i = 0;
  for (i = 0; i <= UINT8_MAX; ++i) {
    sum += i * histogram[i];
  }

