gin66/ESP32_projects/01_qrcode/src/identify.c
  // Compute threshold
  int sumB = 0;
  int q1 = 0;
  float max = 0;
  uint8_t threshold = 0;
  for (i = 0; i <= UINT8_MAX; ++i) {
    // Weighted background
    q1 += histogram[i];
    if (q1 == 0) continue;

    // Weighted foreground
    const int q2 = numPixels - q1;
    if (q2 == 0) break;

    sumB += i * histogram[i];
    const float m1 = (float)sumB / q1;
    const float m2 = ((float)sum - sumB) / q2;
    const float m1m2 = m1 - m2;
    const float variance = m1m2 * m1m2 * q1 * q2;
    if (variance >= max) {
      threshold = i;
      max = variance;
    }
  }

  return threshold;
}

static void area_count(void *user_data, int y, int left, int right) {
  ((struct quirc_region *)user_data)->count += right - left + 1;
}

static int region_code(struct quirc *q, int x, int y) {
  int pixel;
  struct quirc_region *box;
  int region;

  if (x < 0 || y < 0 || x >= q->w || y >= q->h) return -1;

  pixel = q->pixels[y * q->w + x];

  if (pixel >= QUIRC_PIXEL_REGION) return pixel;

  if (pixel == QUIRC_PIXEL_WHITE) return -1;

  if (q->num_regions >= QUIRC_MAX_REGIONS) return -1;

  region = q->num_regions;
  box = &q->regions[q->num_regions++];

  memset(box, 0, sizeof(*box));

  box->seed.x = x;
  box->seed.y = y;
  box->capstone = -1;

  flood_fill_seed(q, x, y, pixel, region, area_count, box, 0);

  return region;
}

struct polygon_score_data {
  struct quirc_point ref;

  int scores[4];
  struct quirc_point *corners;
};

static void find_one_corner(void *user_data, int y, int left, int right) {
  struct polygon_score_data *psd = (struct polygon_score_data *)user_data;
  int xs[2] = {left, right};
  int dy = y - psd->ref.y;
  int i;

  for (i = 0; i < 2; i++) {
    int dx = xs[i] - psd->ref.x;
    int d = dx * dx + dy * dy;

    if (d > psd->scores[0]) {
      psd->scores[0] = d;
      psd->corners[0].x = xs[i];
      psd->corners[0].y = y;
    }
  }
}

static void find_other_corners(void *user_data, int y, int left, int right) {
  struct polygon_score_data *psd = (struct polygon_score_data *)user_data;
  int xs[2] = {left, right};
  int i;

  for (i = 0; i < 2; i++) {
    int up = xs[i] * psd->ref.x + y * psd->ref.y;
    int right = xs[i] * -psd->ref.y + y * psd->ref.x;
    int scores[4] = {up, right, -up, -right};
    int j;

    for (j = 0; j < 4; j++) {
      if (scores[j] > psd->scores[j]) {
        psd->scores[j] = scores[j];
        psd->corners[j].x = xs[i];
        psd->corners[j].y = y;
      }
    }
  }
}

static void find_region_corners(struct quirc *q, int rcode,
                                const struct quirc_point *ref,
                                struct quirc_point *corners) {
  struct quirc_region *region = &q->regions[rcode];
  struct polygon_score_data psd;
  int i;

  memset(&psd, 0, sizeof(psd));
  psd.corners = corners;

  memcpy(&psd.ref, ref, sizeof(psd.ref));
  psd.scores[0] = -1;
  flood_fill_seed(q, region->seed.x, region->seed.y, rcode, QUIRC_PIXEL_BLACK,
                  find_one_corner, &psd, 0);

  psd.ref.x = psd.corners[0].x - psd.ref.x;
  psd.ref.y = psd.corners[0].y - psd.ref.y;

  for (i = 0; i < 4; i++)
    memcpy(&psd.corners[i], &region->seed, sizeof(psd.corners[i]));

  i = region->seed.x * psd.ref.x + region->seed.y * psd.ref.y;
  psd.scores[0] = i;
  psd.scores[2] = -i;
  i = region->seed.x * -psd.ref.y + region->seed.y * psd.ref.x;
  psd.scores[1] = i;
  psd.scores[3] = -i;

  flood_fill_seed(q, region->seed.x, region->seed.y, QUIRC_PIXEL_BLACK, rcode,
                  find_other_corners, &psd, 0);
}

static void record_capstone(struct quirc *q, int ring, int stone) {
  struct quirc_region *stone_reg = &q->regions[stone];
  struct quirc_region *ring_reg = &q->regions[ring];
  struct quirc_capstone *capstone;
  int cs_index;

  if (q->num_capstones >= QUIRC_MAX_CAPSTONES) return;

  cs_index = q->num_capstones;
  capstone = &q->capstones[q->num_capstones++];

  memset(capstone, 0, sizeof(*capstone));

  capstone->qr_grid = -1;
  capstone->ring = ring;
  capstone->stone = stone;
  stone_reg->capstone = cs_index;
  ring_reg->capstone = cs_index;

  /* Find the corners of the ring */
  find_region_corners(q, ring, &stone_reg->seed, capstone->corners);

  /* Set up the perspective transform and find the center */
  perspective_setup(capstone->c, capstone->corners, 7.0, 7.0);
  perspective_map(capstone->c, 3.5, 3.5, &capstone->center);
}

static void test_capstone(struct quirc *q, int x, int y, int *pb) {
  int ring_right = region_code(q, x - pb[4], y);
  int stone = region_code(q, x - pb[4] - pb[3] - pb[2], y);
  int ring_left = region_code(q, x - pb[4] - pb[3] - pb[2] - pb[1] - pb[0], y);
  struct quirc_region *stone_reg;
  struct quirc_region *ring_reg;
  int ratio;

  if (ring_left < 0 || ring_right < 0 || stone < 0) return;

  /* Left and ring of ring should be connected */
  if (ring_left != ring_right) return;

  /* Ring should be disconnected from stone */
  if (ring_left == stone) return;

  stone_reg = &q->regions[stone];
  ring_reg = &q->regions[ring_left];

  /* Already detected */
  if (stone_reg->capstone >= 0 || ring_reg->capstone >= 0) return;

  /* Ratio should ideally be 37.5 */
  ratio = stone_reg->count * 100 / ring_reg->count;
  if (ratio < 10 || ratio > 70) return;

  record_capstone(q, ring_left, stone);
}

static void finder_scan(struct quirc *q, int y) {
  quirc_pixel_t *row = q->pixels + y * q->w;
  int x;
  int last_color = 0;
  int run_length = 0;
  int run_count = 0;
  int pb[5];

  memset(pb, 0, sizeof(pb));
  for (x = 0; x < q->w; x++) {
    int color = row[x] ? 1 : 0;

    if (x && color != last_color) {
      memmove(pb, pb + 1, sizeof(pb[0]) * 4);
      pb[4] = run_length;
      run_length = 0;
      run_count++;

      if (!color && run_count >= 5) {
        static int check[5] = {1, 1, 3, 1, 1};
        int avg, err;
        int i;
        int ok = 1;

        avg = (pb[0] + pb[1] + pb[3] + pb[4]) / 4;
        err = avg * 3 / 4;

        for (i = 0; i < 5; i++)
          if (pb[i] < check[i] * avg - err || pb[i] > check[i] * avg + err)
            ok = 0;

        if (ok) test_capstone(q, x, y, pb);
      }
    }

