gin66/ESP32_projects/01_qrcode/src/identify.c
    run_length++;
    last_color = color;
  }
}

static void find_alignment_pattern(struct quirc *q, int index) {
  struct quirc_grid *qr = &q->grids[index];
  struct quirc_capstone *c0 = &q->capstones[qr->caps[0]];
  struct quirc_capstone *c2 = &q->capstones[qr->caps[2]];
  struct quirc_point a;
  struct quirc_point b;
  struct quirc_point c;
  int size_estimate;
  int step_size = 1;
  int dir = 0;
  float u, v;

  /* Grab our previous estimate of the alignment pattern corner */
  memcpy(&b, &qr->align, sizeof(b));

  /* Guess another two corners of the alignment pattern so that we
   * can estimate its size.
   */
  perspective_unmap(c0->c, &b, &u, &v);
  perspective_map(c0->c, u, v + 1.0, &a);
  perspective_unmap(c2->c, &b, &u, &v);
  perspective_map(c2->c, u + 1.0, v, &c);

  size_estimate = abs((a.x - b.x) * -(c.y - b.y) + (a.y - b.y) * (c.x - b.x));

  /* Spiral outwards from the estimate point until we find something
   * roughly the right size. Don't look too far from the estimate
   * point.
   */
  while (step_size * step_size < size_estimate * 100) {
    static const int dx_map[] = {1, 0, -1, 0};
    static const int dy_map[] = {0, -1, 0, 1};
    int i;

    for (i = 0; i < step_size; i++) {
      int code = region_code(q, b.x, b.y);

      if (code >= 0) {
        struct quirc_region *reg = &q->regions[code];

        if (reg->count >= size_estimate / 2 &&
            reg->count <= size_estimate * 2) {
          qr->align_region = code;
          return;
        }
      }

      b.x += dx_map[dir];
      b.y += dy_map[dir];
    }

    dir = (dir + 1) % 4;
    if (!(dir & 1)) step_size++;
  }
}

static void find_leftmost_to_line(void *user_data, int y, int left, int right) {
  struct polygon_score_data *psd = (struct polygon_score_data *)user_data;
  int xs[2] = {left, right};
  int i;

  for (i = 0; i < 2; i++) {
    int d = -psd->ref.y * xs[i] + psd->ref.x * y;

    if (d < psd->scores[0]) {
      psd->scores[0] = d;
      psd->corners[0].x = xs[i];
      psd->corners[0].y = y;
    }
  }
}

/* Do a Bresenham scan from one point to another and count the number
 * of black/white transitions.
 */
static int timing_scan(const struct quirc *q, const struct quirc_point *p0,
                       const struct quirc_point *p1) {
  int n = p1->x - p0->x;
  int d = p1->y - p0->y;
  int x = p0->x;
  int y = p0->y;
  int *dom, *nondom;
  int dom_step;
  int nondom_step;
  int a = 0;
  int i;
  int run_length = 0;
  int count = 0;

  if (p0->x < 0 || p0->y < 0 || p0->x >= q->w || p0->y >= q->h) return -1;
  if (p1->x < 0 || p1->y < 0 || p1->x >= q->w || p1->y >= q->h) return -1;

  if (abs(n) > abs(d)) {
    int swap = n;

    n = d;
    d = swap;

    dom = &x;
    nondom = &y;
  } else {
    dom = &y;
    nondom = &x;
  }

  if (n < 0) {
    n = -n;
    nondom_step = -1;
  } else {
    nondom_step = 1;
  }

  if (d < 0) {
    d = -d;
    dom_step = -1;
  } else {
    dom_step = 1;
  }

  x = p0->x;
  y = p0->y;
  for (i = 0; i <= d; i++) {
    int pixel;

    if (y < 0 || y >= q->h || x < 0 || x >= q->w) break;

    pixel = q->pixels[y * q->w + x];

    if (pixel) {
      if (run_length >= 2) count++;
      run_length = 0;
    } else {
      run_length++;
    }

    a += n;
    *dom += dom_step;
    if (a >= d) {
      *nondom += nondom_step;
      a -= d;
    }
  }

  return count;
}

/* Try the measure the timing pattern for a given QR code. This does
 * not require the global perspective to have been set up, but it
 * does require that the capstone corners have been set to their
 * canonical rotation.
 *
 * For each capstone, we find a point in the middle of the ring band
 * which is nearest the centre of the code. Using these points, we do
 * a horizontal and a vertical timing scan.
 */
static int measure_timing_pattern(struct quirc *q, int index) {
  struct quirc_grid *qr = &q->grids[index];
  int i;
  int scan;
  int ver;
  int size;

  for (i = 0; i < 3; i++) {
    static const float us[] = {6.5, 6.5, 0.5};
    static const float vs[] = {0.5, 6.5, 6.5};
    struct quirc_capstone *cap = &q->capstones[qr->caps[i]];

    perspective_map(cap->c, us[i], vs[i], &qr->tpep[i]);
  }

  qr->hscan = timing_scan(q, &qr->tpep[1], &qr->tpep[2]);
  qr->vscan = timing_scan(q, &qr->tpep[1], &qr->tpep[0]);

  scan = qr->hscan;
  if (qr->vscan > scan) scan = qr->vscan;

  /* If neither scan worked, we can't go any further. */
  if (scan < 0) return -1;

  /* Choose the nearest allowable grid size */
  size = scan * 2 + 13;
  ver = (size - 15) / 4;
  if (ver > QUIRC_MAX_VERSION) {
    return -1;
  }

  qr->grid_size = ver * 4 + 17;
  return 0;
}

/* Read a cell from a grid using the currently set perspective
 * transform. Returns +/- 1 for black/white, 0 for cells which are
 * out of image bounds.
 */
static int read_cell(const struct quirc *q, int index, int x, int y) {
  const struct quirc_grid *qr = &q->grids[index];
  struct quirc_point p;

  perspective_map(qr->c, x + 0.5, y + 0.5, &p);
  if (p.y < 0 || p.y >= q->h || p.x < 0 || p.x >= q->w) return 0;

  return q->pixels[p.y * q->w + p.x] ? 1 : -1;
}

static int fitness_cell(const struct quirc *q, int index, int x, int y) {
  const struct quirc_grid *qr = &q->grids[index];
  int score = 0;
  int u, v;

  for (v = 0; v < 3; v++)
    for (u = 0; u < 3; u++) {
      static const float offsets[] = {0.3, 0.5, 0.7};
      struct quirc_point p;

      perspective_map(qr->c, x + offsets[u], y + offsets[v], &p);
      if (p.y < 0 || p.y >= q->h || p.x < 0 || p.x >= q->w) continue;

      if (q->pixels[p.y * q->w + p.x])
        score++;
      else
        score--;
    }

  return score;
}

static int fitness_ring(const struct quirc *q, int index, int cx, int cy,
                        int radius) {
  int i;
  int score = 0;

  for (i = 0; i < radius * 2; i++) {
    score += fitness_cell(q, index, cx - radius + i, cy - radius);
    score += fitness_cell(q, index, cx - radius, cy + radius - i);
    score += fitness_cell(q, index, cx + radius, cy - radius + i);
    score += fitness_cell(q, index, cx + radius - i, cy + radius);
  }

  return score;
}

static int fitness_apat(const struct quirc *q, int index, int cx, int cy) {
  return fitness_cell(q, index, cx, cy) - fitness_ring(q, index, cx, cy, 1) +
         fitness_ring(q, index, cx, cy, 2);
}

static int fitness_capstone(const struct quirc *q, int index, int x, int y) {
  x += 3;
  y += 3;

  return fitness_cell(q, index, x, y) + fitness_ring(q, index, x, y, 1) -
         fitness_ring(q, index, x, y, 2) + fitness_ring(q, index, x, y, 3);
}

/* Compute a fitness score for the currently configured perspective
 * transform, using the features we expect to find by scanning the
 * grid.
 */
static int fitness_all(const struct quirc *q, int index) {
  const struct quirc_grid *qr = &q->grids[index];
  int version = (qr->grid_size - 17) / 4;
  const struct quirc_version_info *info = &quirc_version_db[version];
  int score = 0;
  int i, j;
  int ap_count;

  /* Check the timing pattern */
  for (i = 0; i < qr->grid_size - 14; i++) {
    int expect = (i & 1) ? 1 : -1;

    score += fitness_cell(q, index, i + 7, 6) * expect;
    score += fitness_cell(q, index, 6, i + 7) * expect;
  }

  /* Check capstones */
  score += fitness_capstone(q, index, 0, 0);
  score += fitness_capstone(q, index, qr->grid_size - 7, 0);
  score += fitness_capstone(q, index, 0, qr->grid_size - 7);

  if (version < 0 || version > QUIRC_MAX_VERSION) return score;

  /* Check alignment patterns */
  ap_count = 0;
  while ((ap_count < QUIRC_MAX_ALIGNMENT) && info->apat[ap_count]) ap_count++;

  for (i = 1; i + 1 < ap_count; i++) {
    score += fitness_apat(q, index, 6, info->apat[i]);
    score += fitness_apat(q, index, info->apat[i], 6);
  }

  for (i = 1; i < ap_count; i++)
    for (j = 1; j < ap_count; j++)
      score += fitness_apat(q, index, info->apat[i], info->apat[j]);

  return score;
}

