gin66/ESP32_projects/01_qrcode/src/identify.c
static void jiggle_perspective(struct quirc *q, int index) {
  struct quirc_grid *qr = &q->grids[index];
  int best = fitness_all(q, index);
  int pass;
  float adjustments[8];
  int i;

  for (i = 0; i < 8; i++) adjustments[i] = qr->c[i] * 0.02;

  for (pass = 0; pass < 5; pass++) {
    for (i = 0; i < 16; i++) {
      int j = i >> 1;
      int test;
      float old = qr->c[j];
      float step = adjustments[j];
      float new;

      if (i & 1)
        new = old + step;
      else
        new = old - step;

      qr->c[j] = new;
      test = fitness_all(q, index);

      if (test > best)
        best = test;
      else
        qr->c[j] = old;
    }

    for (i = 0; i < 8; i++) adjustments[i] *= 0.5;
  }
}

/* Once the capstones are in place and an alignment point has been
 * chosen, we call this function to set up a grid-reading perspective
 * transform.
 */
static void setup_qr_perspective(struct quirc *q, int index) {
  struct quirc_grid *qr = &q->grids[index];
  struct quirc_point rect[4];

  /* Set up the perspective map for reading the grid */
  memcpy(&rect[0], &q->capstones[qr->caps[1]].corners[0], sizeof(rect[0]));
  memcpy(&rect[1], &q->capstones[qr->caps[2]].corners[0], sizeof(rect[0]));
  memcpy(&rect[2], &qr->align, sizeof(rect[0]));
  memcpy(&rect[3], &q->capstones[qr->caps[0]].corners[0], sizeof(rect[0]));
  perspective_setup(qr->c, rect, qr->grid_size - 7, qr->grid_size - 7);

  jiggle_perspective(q, index);
}

/* Rotate the capstone with so that corner 0 is the leftmost with respect
 * to the given reference line.
 */
static void rotate_capstone(struct quirc_capstone *cap,
                            const struct quirc_point *h0,
                            const struct quirc_point *hd) {
  struct quirc_point copy[4];
  int j;
  int best = 0;
  int best_score = INT_MAX;

  for (j = 0; j < 4; j++) {
    struct quirc_point *p = &cap->corners[j];
    int score = (p->x - h0->x) * -hd->y + (p->y - h0->y) * hd->x;

    if (!j || score < best_score) {
      best = j;
      best_score = score;
    }
  }

  /* Rotate the capstone */
  for (j = 0; j < 4; j++)
    memcpy(&copy[j], &cap->corners[(j + best) % 4], sizeof(copy[j]));
  memcpy(cap->corners, copy, sizeof(cap->corners));
  perspective_setup(cap->c, cap->corners, 7.0, 7.0);
}

static void record_qr_grid(struct quirc *q, int a, int b, int c) {
  struct quirc_point h0, hd;
  int i;
  int qr_index;
  struct quirc_grid *qr;

  if (q->num_grids >= QUIRC_MAX_GRIDS) return;

  /* Construct the hypotenuse line from A to C. B should be to
   * the left of this line.
   */
  memcpy(&h0, &q->capstones[a].center, sizeof(h0));
  hd.x = q->capstones[c].center.x - q->capstones[a].center.x;
  hd.y = q->capstones[c].center.y - q->capstones[a].center.y;

  /* Make sure A-B-C is clockwise */
  if ((q->capstones[b].center.x - h0.x) * -hd.y +
          (q->capstones[b].center.y - h0.y) * hd.x >
      0) {
    int swap = a;

    a = c;
    c = swap;
    hd.x = -hd.x;
    hd.y = -hd.y;
  }

  /* Record the grid and its components */
  qr_index = q->num_grids;
  qr = &q->grids[q->num_grids++];

  memset(qr, 0, sizeof(*qr));
  qr->caps[0] = a;
  qr->caps[1] = b;
  qr->caps[2] = c;
  qr->align_region = -1;

  /* Rotate each capstone so that corner 0 is top-left with respect
   * to the grid.
   */
  for (i = 0; i < 3; i++) {
    struct quirc_capstone *cap = &q->capstones[qr->caps[i]];

    rotate_capstone(cap, &h0, &hd);
    cap->qr_grid = qr_index;
  }

  /* Check the timing pattern. This doesn't require a perspective
   * transform.
   */
  if (measure_timing_pattern(q, qr_index) < 0) goto fail;

  /* Make an estimate based for the alignment pattern based on extending
   * lines from capstones A and C.
   */
  if (!line_intersect(&q->capstones[a].corners[0], &q->capstones[a].corners[1],
                      &q->capstones[c].corners[0], &q->capstones[c].corners[3],
                      &qr->align))
    goto fail;

  /* On V2+ grids, we should use the alignment pattern. */
  if (qr->grid_size > 21) {
    /* Try to find the actual location of the alignment pattern. */
    find_alignment_pattern(q, qr_index);

    /* Find the point of the alignment pattern closest to the
     * top-left of the QR grid.
     */
    if (qr->align_region >= 0) {
      struct polygon_score_data psd;
      struct quirc_region *reg = &q->regions[qr->align_region];

      /* Start from some point inside the alignment pattern */
      memcpy(&qr->align, &reg->seed, sizeof(qr->align));

      memcpy(&psd.ref, &hd, sizeof(psd.ref));
      psd.corners = &qr->align;
      psd.scores[0] = -hd.y * qr->align.x + hd.x * qr->align.y;

      flood_fill_seed(q, reg->seed.x, reg->seed.y, qr->align_region,
                      QUIRC_PIXEL_BLACK, NULL, NULL, 0);
      flood_fill_seed(q, reg->seed.x, reg->seed.y, QUIRC_PIXEL_BLACK,
                      qr->align_region, find_leftmost_to_line, &psd, 0);
    }
  }

  setup_qr_perspective(q, qr_index);
  return;

fail:
  /* We've been unable to complete setup for this grid. Undo what we've
   * recorded and pretend it never happened.
   */
  for (i = 0; i < 3; i++) q->capstones[qr->caps[i]].qr_grid = -1;
  q->num_grids--;
}

struct neighbour {
  int index;
  float distance;
};

struct neighbour_list {
  struct neighbour n[QUIRC_MAX_CAPSTONES];
  int count;
};

static void test_neighbours(struct quirc *q, int i,
                            const struct neighbour_list *hlist,
                            const struct neighbour_list *vlist) {
  int j, k;
  float best_score = 0.0;
  int best_h = -1, best_v = -1;

  /* Test each possible grouping */
  for (j = 0; j < hlist->count; j++)
    for (k = 0; k < vlist->count; k++) {
      const struct neighbour *hn = &hlist->n[j];
      const struct neighbour *vn = &vlist->n[k];
      float score = fabs(1.0 - hn->distance / vn->distance);

      if (score > 2.5) continue;

      if (best_h < 0 || score < best_score) {
        best_h = hn->index;
        best_v = vn->index;
        best_score = score;
      }
    }

  if (best_h < 0 || best_v < 0) return;

  record_qr_grid(q, best_h, i, best_v);
}

static void test_grouping(struct quirc *q, int i) {
  struct quirc_capstone *c1 = &q->capstones[i];
  int j;
  struct neighbour_list hlist;
  struct neighbour_list vlist;

  if (c1->qr_grid >= 0) return;

  hlist.count = 0;
  vlist.count = 0;

