gin66/ESP32_projects/01_qrcode/src/identify.c
  /* Look for potential neighbours by examining the relative gradients
   * from this capstone to others.
   */
  for (j = 0; j < q->num_capstones; j++) {
    struct quirc_capstone *c2 = &q->capstones[j];
    float u, v;

    if (i == j || c2->qr_grid >= 0) continue;

    perspective_unmap(c1->c, &c2->center, &u, &v);

    u = fabs(u - 3.5);
    v = fabs(v - 3.5);

    if (u < 0.2 * v) {
      struct neighbour *n = &hlist.n[hlist.count++];

      n->index = j;
      n->distance = v;
    }

    if (v < 0.2 * u) {
      struct neighbour *n = &vlist.n[vlist.count++];

      n->index = j;
      n->distance = u;
    }
  }

  if (!(hlist.count && vlist.count)) return;

  test_neighbours(q, i, &hlist, &vlist);
}

static void pixels_setup(struct quirc *q, uint8_t threshold) {
  if (QUIRC_PIXEL_ALIAS_IMAGE) {
    q->pixels = (quirc_pixel_t *)q->image;
  }

  uint8_t *source = q->image;
  quirc_pixel_t *dest = q->pixels;
  int length = q->w * q->h;
  while (length--) {
    uint8_t value = *source++;
    *dest++ = (value < threshold) ? QUIRC_PIXEL_BLACK : QUIRC_PIXEL_WHITE;
  }
}

uint8_t *quirc_begin(struct quirc *q, int *w, int *h) {
  q->num_regions = QUIRC_PIXEL_REGION;
  q->num_capstones = 0;
  q->num_grids = 0;

  if (w) *w = q->w;
  if (h) *h = q->h;

  return q->image;
}

void quirc_end(struct quirc *q) {
  int i;

  uint8_t threshold = otsu(q);
  pixels_setup(q, threshold);

  for (i = 0; i < q->h; i++) finder_scan(q, i);

  for (i = 0; i < q->num_capstones; i++) test_grouping(q, i);
}

void quirc_extract(const struct quirc *q, int index, struct quirc_code *code) {
  const struct quirc_grid *qr = &q->grids[index];
  int y;
  int i = 0;

  if (index < 0 || index > q->num_grids) return;

  memset(code, 0, sizeof(*code));

  perspective_map(qr->c, 0.0, 0.0, &code->corners[0]);
  perspective_map(qr->c, qr->grid_size, 0.0, &code->corners[1]);
  perspective_map(qr->c, qr->grid_size, qr->grid_size, &code->corners[2]);
  perspective_map(qr->c, 0.0, qr->grid_size, &code->corners[3]);

  code->size = qr->grid_size;

  for (y = 0; y < qr->grid_size; y++) {
    int x;
    for (x = 0; x < qr->grid_size; x++) {
      if (read_cell(q, index, x, y) > 0) {
        code->cell_bitmap[i >> 3] |= (1 << (i & 7));
      }
      i++;
    }
  }
}
